---
type: InitialWattageIntensity
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 3
tags: [revit-api, class]
---

# InitialWattageIntensity

`Autodesk.Revit.DB.Lighting.InitialWattageIntensity` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | InitialWattageIntensity | — | `` |
| Property | Efficacy | 2013 | `public double Efficacy { get ; set ; }` |
| Property | Wattage | 2013 | `public double Wattage { get ; set ; }` |